# GetIntersectingElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..GetIntersectingElements Method
DividedPath Class See Also
---
Get the elements whose intersection with path produces points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetIntersectingElements()
```

Visual Basic
---
```text
Public Function GetIntersectingElements As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetIntersectingElements()
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace